In [0]:
-- -- create database if not exists salesorder;
-- --create schema customer;

-- create table customer.cust_details 
--     (
--       cust_id int identity(1,1) primary key, 
--     cust_name varchar(100),
--     cust_age int,
--     cust_address varchar(100),
--     cust_order int,
--     order_date date
--     );


-- CREATE TABLE customer.cust_details 
-- (
--   cust_id BIGINT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
--   cust_name VARCHAR(100),
--   cust_age INT,
--   cust_address VARCHAR(100),
--   cust_order INT,
--   order_date DATE
-- );

select * from customer.cust_details order by cust_id;

insert into customer.cust_details values ('John',25,'NY',10,'2022-01-01'),
                                         ('Jane',30,'LA',20,'2022-01-02'),
                                         ('Bob',28,'NY',15,'2022-01-03');


insert into customer.cust_details 
    (cust_name, cust_age, cust_address, cust_order, order_date)
values 
    ('Steven', 25, 'NY', 10, '2022-01-01'),
    ('Neena', 30, 'LA', 20, '2022-01-02'),
    ('Lori', 28, 'NY', 15, '2022-01-03');


alter table customer.cust_details
add columns cust_status varchar(10);

update customer.cust_details
set cust_status = 'active'
where cust_id = 1 or cust_id = 2 or cust_id = 3 or cust_id = 4 or cust_id = 5  or cust_id = 6 or cust_id = 7 or cust_id = 8 or cust_id = 9 or cust_id = 10;

-- alter table customer.cust_details
-- dr

delete from customer.cust_details
where cust_name is null;

update customer.cust_details
set cust_status = 'inactive'
where cust_id = 5;


select * from customer.cust_details order by cust_id;

alter table customer.cust_details
rename column order_date to order_dt;

select * from customer.cust_details order by cust_id;

ALTER TABLE customer.cust_details 
SET TBLPROPERTIES (
  'delta.columnMapping.mode' = 'name'
);

ALTER TABLE customer.cust_details 
RENAME COLUMN order_date TO order_dt;

alter table customer.cust_details
alter column cust_order type varchar(10);

-- change datatype in delta

-- Step 1: Add a new column with the desired type
ALTER TABLE customer.cust_details
ADD COLUMNS (cust_order_new VARCHAR(10));

-- Step 2: Copy data from the old column to the new column
UPDATE customer.cust_details
SET cust_order_new = CAST(cust_order AS VARCHAR(10));

-- Step 3: Drop the old column
ALTER TABLE customer.cust_details
DROP COLUMNS (cust_order);

-- Step 4: Rename the new column to the original name
ALTER TABLE customer.cust_details
RENAME COLUMN cust_order_new TO cust_order;

select * from customer.cust_details order by cust_id;


SELECT *
FROM customer.cust_details
ORDER BY cust_id
LIMIT 1 offset 2;

create table customer.cust_new 
(select * from customer.cust_details);

select * from customer.cust_new order by cust_id;

select cust_name into temp
from customer.cust_details;

select substr('suganthi B',1,length('suganthi')) as name;
select substr('suganthi B',1,instr('Suganthi B',' ')) as name;

select substr('suganthi Bala@mail',instr('Suganthi Bala@mail','@')+1) as name;

select substr('suganthi Bala@mail',instr('Suganthi Bala@mail',' '), instr('Suganthi Bala@mail','@') - instr('Suganthi Bala@mail',' ')) as name;


select substr('suganthi Bala@mail', instr('suganthi Bala@mail',' ')+1, instr('suganthi Bala@mail','@') - instr('suganthi Bala@mail',' ')-1) as name;

select * from '/Volumes/workspace/default/emp/EMP_DELTA/';


select * from delta.`/Volumes/workspace/default/emp/EMP_DELTA/`;

select employee_id,first_name,salary, 
(select round(avg(salary),2) from delta.`/Volumes/workspace/default/emp/EMP_DELTA/`) as avgsal 
from delta.`/Volumes/workspace/default/emp/EMP_DELTA/`;

select employee_id, first_name, salary, 
(round(avg(salary) over(),2)) as avgsal 
from delta.`/Volumes/workspace/default/emp/EMP_DELTA/`
group by employee_id, first_name, salary;

select employee_id,first_name,salary, 
avg(salary) over() as avgsal 
from delta.`/Volumes/workspace/default/emp/EMP_DELTA/`;

select employee_id, avgsal from (select employee_id, salary, 
(round(avg(salary) over(),2)) as avgsal 
from delta.`/Volumes/workspace/default/emp/EMP_DELTA/`) as t1;

select * from csv.`/Volumes/workspace/default/emp/src_DEPT_FF.csv`;


select * from delta.`/Volumes/workspace/default/emp/EMP_DELTA`
where department_id in (select department_id from csv.`/Volumes/workspace/default/emp/src_DEPT_FF.csv`);

select * from delta.`/Volumes/workspace/default/emp/EMP_DELTA`
where exists (select department_id from csv.`/Volumes/workspace/default/emp/src_DEPT_FF.csv`);


select *
from delta.`/Volumes/workspace/default/emp/EMP_DELTA`
where exists (
  select 1
  from csv.`/Volumes/workspace/default/emp/src_DEPT_FF.csv` d
  where d._c0 = EMP_DELTA.department_id
);

select *
from delta.`/Volumes/workspace/default/emp/EMP_DELTA`
where exists (
  select 1
  from csv.`/Volumes/workspace/default/emp/src_DEPT_FF.csv` d
 );

 select max(salary) from  delta.`/Volumes/workspace/default/emp/EMP_DELTA`
 where salary
 < ( select max(salary) from delta.`/Volumes/workspace/default/emp/EMP_DELTA`);

 select salary from delta.`/Volumes/workspace/default/emp/EMP_DELTA`
 order by salary desc
 limit 2 offset 1;

 SELECT cust_order
FROM customer.cust_details
ORDER BY cust_order desc
LIMIT 2 OFFSET 2;


select department_id from delta.`/Volumes/workspace/default/emp/EMP_DELTA`
except (select department_id from csv.`/Volumes/workspace/default/emp/src_DEPT_FF.csv`);

select department_id 
from delta.`/Volumes/workspace/default/emp/EMP_DELTA`
except (
  select _c0 
  from csv.`/Volumes/workspace/default/emp/src_DEPT_FF.csv`
);

select department_id 
from delta.`/Volumes/workspace/default/emp/EMP_DELTA`
except (
  select cast(_c0 as bigint)
  from csv.`/Volumes/workspace/default/emp/src_DEPT_FF.csv`
  where _c0 != 'DEPARTMENT_ID'
);

create temp table tmp_new
(select * from delta.`/Volumes/workspace/default/emp/EMP_DELTA`);

CREATE OR REPLACE TEMP VIEW tmp_new AS
SELECT *
FROM delta.`/Volumes/workspace/default/emp/EMP_DELTA`;

select * from tmp_new;

CREATE OR REPLACE TEMP VIEW tmp_new AS
SELECT *
FROM delta.`/Volumes/workspace/default/emp/EMP_DELTA`;

SELECT *
FROM tmp_new;

SELECT *,  
       NTILE(3) OVER(ORDER BY Salary DESC) SalaryRank 
FROM delta.`/Volumes/workspace/default/emp/EMP_DELTA` 
ORDER BY SalaryRank;



SELECT *,  
       NTILE(3) OVER(ORDER BY Salary DESC) AS SalaryRank 
FROM delta.`/Volumes/workspace/default/emp/EMP_DELTA` 
ORDER BY SalaryRank;

select job_id,
parsename(replace(job_id,'_','.'),2) as dept,
parsename(replace(job_id,'_','.'),1) as jon
from delta.`/Volumes/workspace/default/emp/EMP_DELTA`;


select job_id,
       split(job_id, '_')[0] as dept,
       split(job_id, '_')[1] as job
from delta.`/Volumes/workspace/default/emp/EMP_DELTA`;

select 
       split('s_b_j', '_')[0] as dept,
       split('s_b_j', '_')[1] as job,
       split('s_b_j', '_')[2] as subjob;